//*****************文*件*信*息********************************************
// *文 件 名：Main.h
// *版　  本：v1.0
// *创 建 人：Huangxinglong
// *日　  期：2014/5/23 10:15:00
// *描　  述：
// *
// *当前版本：v1.0
// *修 改 人：Huangxinglong
// *日　  期：2014/5/23 10:15:02
// *描　  述：
//************************************************************************
#ifndef __MAIN_H__
	#define __MAIN_H__
	/*-----宏定义---------------------*/

	/*-----结构体数据类型定义---------*/
	/*-----常量（表格等）声明---------*/
	/*-----函数声明-------------------*/
#endif
//***********************************************************************/
#ifdef   __MAIN_C__
#define  MAIN_EXT
#else
#define  MAIN_EXT  extern
#endif
/*-------------变量声明--------------*/
MAIN_EXT int8u Mode;     // 
MAIN_EXT int8u SubMode;
MAIN_EXT int8u T10MSFlag;
MAIN_EXT int8u T100MSFlag;
MAIN_EXT int8u T500MSFlag;
MAIN_EXT int8u T1SFlag;
//***********************************************************************/